tap 'argon/mas'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/php'

cask_args appdir: '/Applications'

brew 'bash'
brew 'openssl', args: ['universal']
brew 'curl', args: ['with-nghttp2']
brew 'node', args: ['with-full-icu']
brew 'coreutils'
brew 'diff-so-fancy'
brew 'findutils'
brew 'git'
brew 'gawk'
brew 'git-lfs'
brew 'gradle'
brew 'htop'
brew 'mackup'
brew 'mariadb'
brew 'thefuck'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'argon/mas/mas'
brew 'homebrew/dupes/grep'
brew 'homebrew/php/php71', args: ['without-apache']
brew 'homebrew/php/composer'

cask 'appcleaner'
cask 'battle-net'
cask 'discord'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'sequel-pro'
cask 'spotify'
cask 'spotify-notifications'
cask 'sublime-text3'
cask 'telegram'
cask 'utorrent'
cask 'vlc'

cask 'qlcolorcode'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

mas 'Magnet', id: 441258766
mas 'The Unarchiver', id: 425424353
mas 'Xcode', id: 497799835
